<?php

namespace App\Http\Controllers;

use App\Models\Volunteer;

/**
 * 
 */
class Sms
{


    public function volunteer_sms()
    {

        // $all_users = Volunteer::select("phone_number")->where('id', '>', 140)->get();
        $all_users = [9748401992,
        9818193979,
        9816622706,
        9813597315,
        9810080956,
        9814045729,
        9862951016,
        9861766164,
        9851149100,
        9843401010,
        9843119665,
        9749462207,
        9851162513,
        9851052566,
        9851277131,
        9823393178,
        9843019721,
        9843648201,
        9868227889,
        9818965570,
        9849152331,
        9941283498,
        9851109930,
        9749294119,
        9848037409,
        9860002120,
        9869666166,
        9841772888,
        9851236141,
    ];
        $text_message = "सीताराम। अभिषेकात्मक अतिरुद्रमहायज्ञमा आफ्नो स्वयंसेवकको कार्ड लिनको लागि साउन २ गते बिहान ४ बजे उपस्थित हुन अनुरोध गरिन्छ। सितारम ";
        foreach ($all_users as $user) {
            $request_query = [
                "to" => $user,
                "text" => $text_message
            ];
            $this->send_sms($request_query);
        }
    }


    /**
     * Store a newly created resource in storage.
     *
     * @param  \Illuminate\Http\Request  $request
     * @return \Illuminate\Http\Response
     */
    public function user_sms()
    {
        $phone_number = [
            //लघुरुद्र कर्ता
            // "9803842002",
            // "9851183388",
            // "9848122270",
            // "9868122313",
            // "9851033294",
            // "9845711967",
            // "9868225994",
            // "9841378912",
            // "9867604465",
            // "9869541838",
            // "9846052565",
            // "9841425336",
            // "9857038238",
            // "9845360521",
            // "9848039898",
            // "9841527875",
            // "9848115477",
            // "9849773780",
            // "9810248048",
            // "9849665027",
            // "9806658154",
            // "9849583832",
            // "9841323011",
            // "9840241722",
            // "9841252225",
            // "9841805180",
            // "9869516918",
            // "9843539586",
            // // 9941323011
            // "9845276060",
            // "9816144673",
            // "9824101831",
            // "9852066009",
            // "9851236141"


            //         "9851159877",
            //         "9845358752",
            //         "9845197264",
            //         // "5879308499",
            //         "9860504530",
            //         "9868194452",
            //         "9846144073",
            //         "9845246906",
            //         "9860688814",
            //         "9861162915",
            //         "9846043918",
            //         "9848067664",
            //         "9847303472",
            //         "9851133756",
            //         "9845522150",
            //         "9841722872",
            //         "9856029326",
            //         "9843022369",
            //         "9822558930",
            //         "9851277131",
            //         "9845920023",
            //         "9845155666",
            //         "9851014464",
            //         "9846054121",
            //         "9846080704",
            //         "9842044650",
            //         "9748300995",
            //         "9842244452",
            //         "9856032913",
            //         "9842252290",
            //         "9841757086",
            //         "9816500601",
            //         "9846021220",
            //         "9848160248",
            //         "9841397081",
            //         "9842091278",
            //         "9848052312",


        ];

        $first_four = [
            "9843019721",
            // "9880000007",
            // "9849529291",
            // "9869161119",
            // "9841804516",
            "9841404091",
            // "9840382525",
            // "9843048346",
            // "9846318303",
            "9848037205",
            // "9841882339",
            // "9858030893",
            // "9813001659",
            // "9851100476",
            "9841453102",
            // "9851086551",
            // "9865377700",
            // "9856020044",
            // "9848049440",
            // "9841213693",
            // "9866004182",
            // "9851126710",
            // "9841213317",
            "9848049021",
            // "9841665240",
            // "9858050413",
            // "9841254428",
            // "9813080813",
            // "9841486557",
            // "9846354300",
            // "9849505407",
            // "9846054923",
            // "9867148000",
            // "9841541392",
            // "9851100374",
            // "9858050086",
            "9841330778",
            // "9846141490",
            // "9841547151",
            // "9860438765",
            "9856021659",
            // "9841263035",
            // "9841506728",
            // "9841564603",
            // "9841759004",
            "9849370333",
            // "9849258882",
            "9856029164",
            // "9842563299",
            // "9849893679",
            // "9861090095",
            // "9841407669",
            // "9849595466",
            // "9856036566",
            // "9842634465",
            "9849173540",
            // "9845691617",
            // "9856024298",
            // "9842106625",
            // "9865027300",
            // "9848168480",
            // "9861598909",
            "9856087444",
            // "9841580058",
            // "9841235739",
            // "9818689952",
            // "9846044638",
            // "9848048681",
            "9849594116",
            // "9841596815",
            // "9843280899",
            // "9847691267",
            // "9861492623",
            // "9845054164",
            "9841388916",
            // "9846361677",
            // "9841527875",
            // "9849154687",
            // "9846064108",
            // "9851040993",
            // "9851064599",
            // "9856028767",
            // "9840112476",
            // "9862822049",
            // "9856039522",
            // "9841382715",
            // "9847125494",
            // "9841879183",
            // "9858027470",
            // "9841646075",
            "9846523023",
            "9849759566",
            // "9842629322",
            // "9826908121",
            // "9849326132",
            // "9851013381",
            // "9846441576",
            // "9849034814",
            "9816783873",
            // "9841581141",
            "9841228045",
            // "9841572456",
            // "9846049745",
            // "9841808273",
            // "9841096717",
            // "9841375329",
            // "9869726727",
            // "9860339455",
            // "9841694817",
            // "9846087802",
            "9841287097",
            // "9846230696",
            // "9846859932",
            // "9865350109",
            // "9845195589",
            // "9842054855",
            // "9841238272",
            // "9845154265",
            // "9845363098",
            "9856037722",
            // "9851078500",
            "9821288420",
            // "9851161056",
            "9849620224",
            // "9860020286",
            // "9851024858",
            // "9841502369",
            // "9846064713",
            "9846662570",
            // "9848050091",
            // "9749755390",
            "9841300817",
            // "9848051777",
            "9852066009",
            // "9824101831",
            // "9816144673",
            // "9841196963",
            '9851236141',
            '9847112796',
            '9841552627',
            '9841351612'
        ];
        $link = "bit.ly/3bSmCkH";
        // $message = "सीताराम। कृपया यहाँहरुले तल दिईएको लिङ्कमा गएर आफ्नो फारम भर्दाको कोड नं वा मोबाइल नं राखेर Zoom session मा आउन सक्नुहुनेछ। Zoom session को link को लागि यहाँ थिच्नुहोस।";
        $message = "सीताराम।आज 8:45मा हुने अभिषेकात्मकातिरुद्रमहायज्ञम्  Zoom Session मा सहभागीताको लागि तल दिइएको लिङ्कमा थिच्नुहोस।" . $link;
        // $message = "Sitaram.Please write your name with the code on the deposit slip. Your seat for atirudri will only be confirmed after we receive the photo of your deposit voucher on\nWhatsApp.Whatsapp:9852066009\nBank:Nepal Bangladesh bank\nA/C name: Mahayogi Siddhababa Spiritual Academy\nA/C no. 024004571C";
        foreach ($first_four as $send_sms) {
            $request_query = [
                "to" => $send_sms,
                "text" => $message
            ];
            $this->send_sms($request_query);
        }
        // // now let's make sure we send generate appropirate password and than make changes to db.
        // $random_text = \Str::random(6);
        // // get user phone number
        // $request_query = [
        //     'to' => $userDetail->phone_number,
        //     'text' => "सद्गुरदेवबाट प्रदत्त वेदान्त दर्शन साधनामा स्वागत छ।\nसहभागी हुने लिंक\n https://sadhak.siddhamahayog.org \n ID:{$userDetail->phone_number}\n पासवर्ड: {$random_text}\n समस्या परेमा संपर्क गर्ने नं 9852066009"
        // ];
        // $userLogin->password = Hash::make($random_text);
        // // return $this->send_sms($request_query);
        // if ($this->send_sms($request_query)) {
        //     $userLogin->save();
        // }
    }


    private function send_sms($send_param)
    {
        $auth_token =  "aa640550af64b95f7b68122b24ea10f6a0ef305ff18d0c1c5102facf51d00d76";
        $send_param["auth_token"] = $auth_token;
        $url = "https://sms.aakashsms.com/sms/v3/send/";
        # Make the call using API.
        $ch = curl_init();
        curl_setopt($ch, CURLOPT_URL, $url);
        curl_setopt($ch, CURLOPT_POST, 1); ///
        curl_setopt($ch, CURLOPT_POSTFIELDS, $send_param);
        curl_setopt($ch, CURLOPT_RETURNTRANSFER, 1);
        // Response
        $response = curl_exec($ch);
        curl_close($ch);
        $response_param = json_decode($response);
        return ($response_param->error) ? false : true;
    }
}
